app/controllers/movies_controller.rb


      redirect_to movies_path :ratings=>@selected_ratings, :sort=>@sort
    else
      @movies = Movie.where(:rating => @selected_ratings).order(@sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY release_date

    if @selected_ratings && @sort
      @movies = Movie.where(:rating => @selected_ratings).order(@sort).all
    elsif @selected_ratings
      @movies = Movie.where(["rating IN (?)", @selected_ratings])#select with ratings
---
SELECT "movies".* FROM "movies" WHERE 1=0

      end
    else
      @movies = Movie.all#else get all
      @selected_ratings = Movie.uniq.pluck(:rating)
---
SELECT DISTINCT "movies"."rating" FROM "movies"